# OpeningWrapping Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
CompoundStructure..::..OpeningWrapping Property
CompoundStructure Class See Also
---
Indicates the opening wrapping condition defining which shell layers of a wall, in plan view, wrap at inserts and openings.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public OpeningWrappingCondition OpeningWrapping { get; set; }
```

Visual Basic
---
```text
Public Property OpeningWrapping As OpeningWrappingCondition
	Get
	Set
```

Visual C++
---
```text
public:
property OpeningWrappingCondition OpeningWrapping {
	OpeningWrappingCondition get ();
	void set (OpeningWrappingCondition value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
CompoundStructure Class
Autodesk.Revit.DB Namespace